Public Attributes | List of all members
API_RunType Struct Reference
Element Manager
Describes a continous monostyle piece - called run - of a paragraph. More...
#include <APIdefs_Elements.h>
 Public Attributes
 Int32  | from
The beginning character offset of the run in the content.
 Int32  | range
The range of the run in character offset.
 short  | pen
Pen attribute index.
unsigned short  | faceBits
Style (face) of the run:
 short  | font
Font attribute index.
unsigned short  | effectBits
Effect on the run:
 double  | size
Character height in mms.
Detailed Description
Describes a continous monostyle piece - called run - of a paragraph.
Remarks
From Archicad 9 you are able to create multistyle text or textual label. The textContent field of API_ElementMemo structure contains the content. By text or textual label element creating you can pass the content as a UniCode string. In this case all offsets (from, range...) are character offset instead of byte offset. A run can not contain line end character. For more details examine Element Manager example project.
Member Data Documentation
◆ effectBits
 API_RunType::effectBits
Effect on the run:
 Effect  | Style
 APIEffect_StrikeOut  | Strikethrough text
 APIEffect_SuperScript  | Superscript
 APIEffect_SubScript  | Subscript
 APIEffect_Fractional  | Fractional text (not used)
 APIEffect_Protected  | Protected text (autotext reference)
◆ faceBits
 API_RunType::faceBits
Style (face) of the run:
 Face bit  | Style
 APIFace_Plain  | Plain text
 APIFace_Bold  | Bold
 APIFace_Italic  | Italic
 APIFace_Underline  | Underline